// Задание 2

/*Дана переменная x, которая может принимать любое значение. 
Написать программу, которая в зависимости от типа данных x выводит в консоль сообщение вида: «x — число».

Опишите три случая: когда х = числу, строке или логическому типу. В других случаях выводите сообщение: «Тип x не определён».*/

const value = true;       // заданная переменная 
let txt;
switch (typeof(value)){
  case 'number':
    txt = 'number'; 
    break;
  case 'string':
    txt = 'string'; 
    break;
  case 'boolean':
    txt = 'boolean'; 
    break;
  default:
    txt = 'не определено'
}

console.log(txt)
